Revit 2026 API
IFCHybridImport Methods
The IFCHybridImport type exposes the following members.
Methods
Name | Description
CreateMap
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetIFCStepIdToElementIdMap |  Retrieves the association between the original IFC STEP identifiers and the created or updated Elements.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ImportElements(Document, String) | Obsolete.
 Imports IFC Elements using AnyCAD.
ImportElements(Document, String, IFCHybridImportOptions) |  Imports IFC Elements using AnyCAD.
ToString | Returns a string that represents the current object.
(Inherited from Object)
UpdateElements(Document, String) | Obsolete.
 Updates IFC Elements using AnyCAD.
UpdateElements(Document, String, IFCHybridImportOptions) |  Updates IFC Elements using AnyCAD.
Top
See Also
Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace